
目录

# Chapter 2 计算机系统基础

## 2.1 计算机硬件基础
### 一、计算机硬件基本组成
### 二、中央处理器
### 三、存储器


## 2.2 计算机软件基础
### 一、操作系统基础
### 二、程序设计语言基础


## 2.3 数据库系统基础
### 一、数据库技术的产生与发展
### 二、数据库技术基本理论
### 三、数据仓库、联机分析处理和数据挖掘


## 2.4 计算机网络基础
### 一、计算机网络的基本概念
### 二、网络体系结构及协议标准


## 2.5 Internet技术
### 一、TCP/IP基本概念
### 二、Internet的IP地址及域名
### 三、Internet服务
### 四、Internet、Extranet和VPN

内容

# Chapter 2 计算机系统基础

## 2.1 计算机硬件基础
### 一、计算机硬件基本组成
### 二、中央处理器
### 三、存储器


## 2.2 计算机软件基础
### 一、操作系统基础
### 二、程序设计语言基础


## 2.3 数据库系统基础
### 一、数据库技术的产生与发展
### 二、数据库技术基本理论
### 三、数据仓库、联机分析处理和数据挖掘


## 2.4 计算机网络基础
### 一、计算机网络的基本概念
### 二、网络体系结构及协议标准


## 2.5 Internet技术
### 一、TCP/IP基本概念
### 二、Internet的IP地址及域名
### 三、Internet服务
### 四、Internet、Extranet和VPN
